alpri0265/STM32F407ZET6-MODUL-1/Src/screens.c
static const char* state_str(void)
{
    switch (system_state_get()) {
        case SYS_STATE_INIT:  return "INIT ";
        case SYS_STATE_READY: return "READY";
        case SYS_STATE_HOLD:  return "HOLD ";
        case SYS_STATE_ERROR: return "ERROR";
        default: return "?    ";
    }
}

static void render_info_info(void)
{
    char buf[LINE_LEN + 2];
    (void)snprintf(buf, sizeof(buf), "State: %s        ", state_str());
    lcd_print_line(0, buf);
    (void)snprintf(buf, sizeof(buf), "Fault: %u        ", (unsigned)fault_get());
    lcd_print_line(1, buf);
    lcd_print_line(2, "Build bringup      ");
    lcd_print_line(3, "[Back]             ");
}

static void render_info_screen(menu_screen_id_t id)
{
    switch (id) {
        case SCREEN_JOG:       render_info_jog();       break;
        case SCREEN_FEED_MANUAL: render_info_feed_manual(); break;
        case SCREEN_FEED_AUTO:   render_info_feed_auto();   break;
        case SCREEN_Z_PASSES:   render_info_z_passes();    break;
        case SCREEN_X_PASSES:   render_info_x_passes();    break;
        case SCREEN_AXIS_X:    render_info_axis_x();    break;
        case SCREEN_AXIS_Z:    render_info_axis_z();    break;
        case SCREEN_MECHANICS:  render_info_mechanics(); break;
        case SCREEN_SPINDLE:   render_info_spindle();   break;
        case SCREEN_I2C_LCD:   render_info_i2c_lcd();   break;
        case SCREEN_ENCODERS:  render_info_encoders();  break;
        case SCREEN_LIMITS:    render_info_limits();    break;
        case SCREEN_SL_TEST:   render_info_sl_test();   break;
        case SCREEN_ADC_FAULT: render_info_adc_fault();  break;
        case SCREEN_TOOL_ANGLE:     render_info_tool_angle();     break;
        case SCREEN_TOOL_ANGLE_CALIB: render_info_tool_angle_calib(); break;
        case SCREEN_INFO:      render_info_info();      break;
        default:
            lcd_print_line(0, "Unknown screen     ");
            lcd_print_line(1, "                  ");
            lcd_print_line(2, "                  ");
            lcd_print_line(3, "[Back]             ");
            break;
    }
}

static void render_current_screen(void)
{
    menu_screen_id_t cur = menu_current_screen();
    if (menu_screen_type(cur) == MENU_SCREEN_LIST)
        render_list_screen();
    else
        render_info_screen(cur);
}

void screens_init(void)
{
    lcd_init();
#if BRINGUP_MODE
    lcd_clear();
#endif
}

void screens_process(void)
{
#if BRINGUP_MODE
    if (system_state_is(SYS_STATE_READY)) {
        encoder_menu_action_t act = encoder_menu_get_action();
        bool need_render = false;
        menu_screen_id_t cur = menu_current_screen();
        menu_screen_type_t st = menu_screen_type(cur);

        if (cur == SCREEN_X_PASSES && s_prev_menu_screen != SCREEN_X_PASSES)
            s_x_passes_focus = 1u;

        if (cur != SCREEN_TOOL_ANGLE)
            tool_angle_edit_mode = false;

        if (act != ENCODER_MENU_ACTION_NONE) {
            if (cur == SCREEN_TOOL_ANGLE && menu_can_back()) {
                if (tool_angle_edit_mode) {
                    if (act == ENCODER_MENU_ACTION_ENTER) {
                        if (tool_angle_edit_cursor < 3u) {
                            tool_angle_edit_cursor++;
                            need_render = true;
                        } else {
                            tool_angle_set_displayed_deg((float)tool_angle_edit_value / 10.0f);
                            tool_angle_edit_mode = false;
                            need_render = true;
                        }
                    } else if (act == ENCODER_MENU_ACTION_CCW || act == ENCODER_MENU_ACTION_CW) {
                        static const unsigned int place[] = { 1000u, 100u, 10u, 1u };
                        unsigned int step = place[tool_angle_edit_cursor];
                        if (act == ENCODER_MENU_ACTION_CCW) {
                            tool_angle_edit_value += step;
                            if (tool_angle_edit_value > 3599u) tool_angle_edit_value = 3599u;
                        } else {
                            if (tool_angle_edit_value >= step) tool_angle_edit_value -= step;
                            else tool_angle_edit_value = 0u;
                        }
                        need_render = true;
                    }
                } else {
                    if (act == ENCODER_MENU_ACTION_ENTER) {
                        tool_angle_zero();
                        need_render = true;
                    } else if (act == ENCODER_MENU_ACTION_CW) {
                        tool_angle_edit_mode = true;
                        tool_angle_edit_cursor = 0u;
                        {
                            float d = tool_angle_get_deg();
                            if (d < 0.0f) d = 0.0f;
                            if (d >= 360.0f) d = 0.0f;
                            tool_angle_edit_value = (unsigned int)(d * 10.0f + 0.5f);
                            if (tool_angle_edit_value >= 3600u) tool_angle_edit_value = 0u;
                        }
                        need_render = true;
                    } else {
                        menu_back();
                        need_render = true;
                    }
                }
            } else if (cur == SCREEN_TOOL_ANGLE_CALIB && menu_can_back()) {
                if (act == ENCODER_MENU_ACTION_ENTER) {
                    tool_angle_calibrate_180();
                    need_render = true;
                } else if (act == ENCODER_MENU_ACTION_CCW) {
                    menu_back();
                    need_render = true;
                }
            } else if (cur == SCREEN_Z_PASSES && menu_can_back()) {
                unsigned int v = jog_get_z_passes();
                if (act == ENCODER_MENU_ACTION_ENTER) {
                    menu_back();
                    need_render = true;
                } else if (act == ENCODER_MENU_ACTION_CCW) {
                    if (v == 0u)
                        menu_back();
                    else
                        jog_set_z_passes(v - 1u);
                    need_render = true;
                } else if (act == ENCODER_MENU_ACTION_CW) {
                    jog_set_z_passes(v < 99u ? v + 1u : 99u);
                    need_render = true;
                }
            } else if (cur == SCREEN_X_PASSES && menu_can_back()) {
                unsigned int passes = jog_get_x_passes();
                unsigned int step_i = jog_get_x_step_index();
                if (act == ENCODER_MENU_ACTION_ENTER) {
                    if (s_x_passes_focus == 0u) {
                        s_x_passes_focus = 1u;
                    } else {
                        s_x_passes_focus = 0u;
                        menu_back();
                    }
                    need_render = true;
                } else if (act == ENCODER_MENU_ACTION_CCW) {
                    if (s_x_passes_focus == 0u) {
                        if (passes == 0u)
                            menu_back();
                        else
                            jog_set_x_passes(passes - 1u);
                    } else {
                        if (step_i > 0u) jog_set_x_step_index(step_i - 1u);
                    }
                    need_render = true;
                } else if (act == ENCODER_MENU_ACTION_CW) {
                    if (s_x_passes_focus == 0u) {
                        jog_set_x_passes(passes < 99u ? passes + 1u : 99u);
                    } else {
                        jog_set_x_step_index(step_i < 29u ? step_i + 1u : 29u);
                    }
                    need_render = true;
                }
            } else if ((cur == SCREEN_JOG || cur == SCREEN_FEED_AUTO || cur == SCREEN_SL_TEST) && menu_can_back()) {
                if (act == ENCODER_MENU_ACTION_CCW) {
                    /* Зберігаємо останній показ Xf/Zf при виході з Jog/Feed Auto */
                    if (cur == SCREEN_JOG || cur == SCREEN_FEED_AUTO)
                        axis_feedback_save_last_displayed();
                    menu_back();
                    need_render = true;
                }
                /* Enter і CW — для Jog (перемикання осі, рух), не виходимо */
            } else if (cur == SCREEN_MECHANICS && menu_can_back()) {
                axis_id_t axis = (mech_edit_axis == 0u) ? AXIS_X : AXIS_Z;

                if (act == ENCODER_MENU_ACTION_ENTER) {
                    mech_edit_field = (uint8_t)((mech_edit_field + 1u) & 3u);
                    need_render = true;
                } else if (mech_edit_field == 0u && act == ENCODER_MENU_ACTION_CCW) {
                    /* На полі axis: CCW вихід назад. */
                    menu_back();
                    need_render = true;
                } else {
                    int32_t dir = (act == ENCODER_MENU_ACTION_CW) ? +1 : -1;
                    if (mech_edit_field == 0u) {
                        /* Axis toggle */
                        mech_edit_axis ^= 1u;
                        jog_update_steps_per_mm_from_cfg();
                        need_render = true;
                    } else if (mech_edit_field == 1u) {
                        /* Pitch: mm.mm -> x100 */
                        int32_t v = (int32_t)system_mech_get_pitch_x100(axis);
                        v += dir * 5; /* 0.05 мм */
                        if (v < 100) v = 100;
                        if (v > 2000) v = 2000; /* 20.00 мм */
                        system_mech_set_pitch_x100(axis, (uint16_t)v);
                        jog_update_steps_per_mm_from_cfg();
                        need_render = true;
                    } else if (mech_edit_field == 2u) {
                        /* Microstep */
                        int32_t v = (int32_t)system_mech_get_microstep(axis);
                        v += dir * 1;
                        if (v < 1) v = 1;
                        if (v > 256) v = 256;
                        system_mech_set_microstep(axis, (uint16_t)v);
                        jog_update_steps_per_mm_from_cfg();
                        need_render = true;
                    } else if (mech_edit_field == 3u) {
                        /* Reducer ratio: integer (1..20), step = 1 */
                        int32_t ri = (int32_t)(system_mech_get_reducer_ratio_x1000(axis) / 1000u);
                        ri += dir;
                        if (ri < 1) ri = 1;
                        if (ri > 20) ri = 20;
                        system_mech_set_reducer_ratio_x1000(axis, (uint32_t)(ri * 1000u));
                        jog_update_steps_per_mm_from_cfg();
                        need_render = true;
                    }
                }
            } else if (st == MENU_SCREEN_INFO && menu_can_back()) {
                if (cur == SCREEN_ENCODERS)
                    axis_feedback_save_last_displayed();
                menu_back();
                need_render = true;
            } else if (st == MENU_SCREEN_LIST) {
                if (act == ENCODER_MENU_ACTION_CW) {
                    menu_select_next();
                    need_render = true;
                } else if (act == ENCODER_MENU_ACTION_CCW) {
                    menu_select_prev();
                    need_render = true;
                } else if (act == ENCODER_MENU_ACTION_ENTER) {
                    menu_enter();
                    need_render = true;
                }
            }
            /* Завжди скидаємо дію, щоб encoder_menu_process() знову опитував кнопки */
            encoder_menu_clear_action();
        }

        if (!menu_need_redraw) {
            need_render = true;
            menu_need_redraw = true;
        }
        /* ADC/Fault — повне оновлення не частіше раз на 250 мс */
        /* Limits — оновлення кожні 150 мс, щоб кінцевики відображалися в реальному часі */
        {
            static uint32_t last_adc_tick;
            static uint32_t last_limits_tick;
            static uint32_t last_jog_tick;
            static uint32_t last_linenc_save_tick;
            static int32_t  last_linenc_save_x_um;
            static int32_t  last_linenc_save_z_um;
            uint32_t now = HAL_GetTick();
            if (cur == SCREEN_ADC_FAULT) {
                if ((now - last_adc_tick) >= 250u)
                    need_render = true;
                if (need_render)
                    last_adc_tick = now;
            }
            if (cur == SCREEN_LIMITS || cur == SCREEN_SL_TEST) {
                if ((now - last_limits_tick) >= 150u)
                    need_render = true;
                if (need_render)
                    last_limits_tick = now;
            }
            if (cur == SCREEN_JOG || cur == SCREEN_FEED_AUTO) {
                if ((now - last_jog_tick) >= 100u)
                    need_render = true;
                if (need_render)
                    last_jog_tick = now;

                /* Автозбереження раз в період, щоб гарантовано пережити 15с до power-off.
                 * Це стирає flash досить часто (для тесту ок), але працює надійно.
                 */
#define LINENC_AUTOSAVE_PERIOD_MS  5000u
                if ((now - last_linenc_save_tick) >= LINENC_AUTOSAVE_PERIOD_MS) {
                    int32_t x_um = axis_feedback_pos_um(AXIS_X);
                    int32_t z_um = axis_feedback_pos_um(AXIS_Z);
                    if (x_um != last_linenc_save_x_um || z_um != last_linenc_save_z_um) {
                        axis_feedback_save_last_displayed();
                        last_linenc_save_tick = now;
                        last_linenc_save_x_um = x_um;
                        last_linenc_save_z_um = z_um;
                    }
                }
            }
            if (cur == SCREEN_FEED_MANUAL) {
                if ((now - last_adc_tick) >= 250u)
                    need_render = true;
                if (need_render)
                    last_adc_tick = now;
            }
        }
        if (need_render)
            render_current_screen();
        s_prev_menu_screen = cur;
        /* Кут інструменту: тільки рядок з числом оновлювати раз на 100 мс (не в режимі Set) */
        if (cur == SCREEN_TOOL_ANGLE && !tool_angle_edit_mode) {
            static uint32_t last_tool_tick;
            uint32_t now = HAL_GetTick();
            if ((now - last_tool_tick) >= 100u) {
                tool_angle_refresh_value_only();
                last_tool_tick = now;
            }
        }
        /* Екран калібрування: оновлювати рядок "Now" кожні 100 мс */
        if (cur == SCREEN_TOOL_ANGLE_CALIB) {
            static uint32_t last_calib_tick;
            uint32_t now = HAL_GetTick();
            if ((now - last_calib_tick) >= 100u) {
                float deg = tool_angle_get_deg();
                unsigned int d = (unsigned int)deg;
                unsigned int t = (unsigned int)(deg * 10.0f) % 10u;
                char buf[LINE_LEN + 4];
                (void)snprintf(buf, sizeof(buf), "  Now: %u.%u %c      ", d, t, 0xFF);
                buf[LINE_LEN] = '\0';
                lcd_print_line_deg(3, buf);
                last_calib_tick = now;
            }
        }
    } else {
        menu_need_redraw = false;
        lcd_clear();
        lcd_print_line(0, "INIT...            ");
    }
#else
    switch (system_state_get()) {
        case SYS_STATE_INIT:  lcd_print_line(0, "INIT"); break;
        case SYS_STATE_READY: lcd_print_line(0, "READY"); break;
        case SYS_STATE_HOLD:  lcd_print_line(0, "HOLD"); break;
        case SYS_STATE_ERROR: lcd_print_line(0, "ERROR"); break;
    }
#endif
}
